Repository: Spacebody/Vela
Catalog: Vela/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

# connections.inspector.field.ruleSource
source: Rule Source
zh_hans: 规则来源

# connections.inspector.field.source
source: Source
zh_hans: 来源

# connections.inspector.information.title
source: Connection Information
zh_hans: 连接信息

# connections.inspector.pending.target
source: Updating %@
zh_hans: 正在更新 %@

# connections.inspector.route.help
source: Vela displays Mihomo evidence and does not claim an offline route prediction.
zh_hans: Vela 仅显示 Mihomo 提供的证据，不会声称能够离线预测路由。

# connections.inspector.route.subtitle
source: Runtime evidence reported by Mihomo
zh_hans: Mihomo 报告的运行时证据

# connections.inspector.route.title
source: Why This Route?
zh_hans: 为何使用此路由？

# connections.inspector.summary.subtitle
source: Live endpoint and process metadata
zh_hans: 实时端点和进程元数据

# connections.inspector.summary.title
source: Summary
zh_hans: 摘要

# connections.inspector.title
source: Connection Details
zh_hans: 连接详情

# connections.inspector.transfer.title
source: Transfer
zh_hans: 传输

# connections.lastUpdatedFormat
source: Last updated %@
zh_hans: 上次更新 %@

# connections.metrics.active
source: Active
zh_hans: 活跃

# connections.metrics.downloaded
source: Download
zh_hans: 下载

# connections.metrics.established
source: Established
zh_hans: 已建立

# connections.metrics.memoryFormat
source: Memory %@
zh_hans: 内存 %@

# connections.metrics.noSelection
source: No selection
zh_hans: 未选择

# connections.metrics.protocols
source: Active protocols
zh_hans: 活跃协议

# connections.metrics.session
source: Selected session
zh_hans: 已选会话

# connections.metrics.total
source: Total Connections
zh_hans: 连接总数

# connections.metrics.totalTraffic
source: Total traffic
zh_hans: 总流量

# connections.metrics.uploaded
source: Upload
zh_hans: 上传

# connections.mutation.closing
source: Requesting
zh_hans: 正在请求

# connections.mutation.committing
source: Committing
zh_hans: 正在提交

# connections.mutation.preparing
source: Preparing
zh_hans: 正在准备

# connections.mutation.rollingBack
source: Rolling Back
zh_hans: 正在回滚

# connections.mutation.verifying
source: Verifying
zh_hans: 正在验证

# connections.phase.failure.detail
source: Vela could not load a connection snapshot.
zh_hans: Vela 无法载入连接快照。

# connections.phase.loading.title
source: Loading Connections
zh_hans: 正在载入连接

# connections.phase.offlineWithSnapshot.title
source: Controller Offline — Last Snapshot
zh_hans: Controller 离线 — 上次快照

# connections.phase.partialFailure.detail
source: Showing the last verified snapshot. Refresh to retry.
zh_hans: 正在显示上次验证的快照。请刷新重试。

# connections.phase.partialFailure.title
source: Live Update Interrupted
zh_hans: 实时更新已中断

# connections.phase.pending.detail
source: The connection remains visible until Mihomo confirms the updated snapshot.
zh_hans: 在 Mihomo 确认更新后的快照前，该连接仍会保持可见。

# connections.phase.pending.target.title
source: Disconnecting %@ — %@
zh_hans: 正在断开 %@ — %@

# connections.phase.pending.title
source: Updating Connections
zh_hans: 正在更新连接

# connections.phase.refreshing.detail
source: Showing the last verified snapshot while Vela requests current data.
zh_hans: Vela 请求当前数据时，将继续显示上次验证的快照。

# connections.phase.refreshing.title
source: Refreshing Connections
zh_hans: 正在刷新连接

# connections.phase.stale.title
source: Connection Data Is Stale
zh_hans: 连接数据已过期

# connections.routeEvidence.ambiguous
source: Ambiguous Route Evidence
zh_hans: 路由证据不明确

# connections.routeEvidence.exact
source: Exact Runtime Evidence
zh_hans: 精确运行时证据

# connections.routeEvidence.stale
source: Stale Route Evidence
zh_hans: 路由证据已过期

# connections.routeEvidence.unavailable
source: Confidence Unavailable
zh_hans: 置信度不可用

# connections.search.compact
source: Search…
zh_hans: 搜索…

# connections.snapshot.age.seconds
source: Last verified %lld seconds ago. Mutating actions are unavailable.
zh_hans: 上次验证于 %lld 秒前。当前无法执行变更操作。

# connections.snapshot.age.unknown
source: The last verified snapshot time is unavailable.
zh_hans: 无法获取上次验证快照的时间。

# connections.status.degraded
source: Degraded
zh_hans: 性能下降

# connections.status.disconnected
source: Disconnected
zh_hans: 已断开

# connections.status.established
source: Established
zh_hans: 已建立

# connections.status.live
source: Live
zh_hans: 实时

# connections.status.paused
source: Paused
zh_hans: 已暂停

# connections.status.ready
source: Ready
zh_hans: 就绪

# connections.status.stale
source: Stale
zh_hans: 已过期

# connections.status.updating
source: Updating
zh_hans: 更新中

# connections.subtitle
source: Real-time connection monitor
zh_hans: 实时连接监控

# connections.value.unavailable
source: Unavailable
zh_hans: 不可用

# diagnostics.checkState.failed
source: Failed
zh_hans: 失败

# diagnostics.checkState.inProgress
source: In progress
zh_hans: 进行中

# diagnostics.checkState.needsAttention
source: Needs attention
zh_hans: 需要处理

# diagnostics.checkState.notRequired
source: Not required
zh_hans: 无需检查

# diagnostics.checkState.passed
source: Passed
zh_hans: 已通过

# diagnostics.cleanup.confirmation.detail
source: Vela will authenticate the privileged component, stop only its verified owned instance if needed, clean owned interface/routes/staging, and verify the stopped state twice. The component remains registered; current and previous root configurations are retained until uninstall.
zh_hans: Vela 将验证特权组件，必要时仅停止经验证且归 Vela 所有的实例，清理由 Vela 管理的接口、路由与暂存内容，并两次确认停止状态。组件会继续保持注册；卸载前将保留当前及上一个 Root 配置。

# diagnostics.cleanup.noActiveTunRuntime
source: No active TUN runtime
zh_hans: 没有活动的 TUN 运行时

# diagnostics.cleanup.result.complete
source: Cleanup Complete
zh_hans: 清理完成

# diagnostics.cleanup.result.failed
source: Cleanup Failed
zh_hans: 清理失败

# diagnostics.cleanup.runtimeMayBeActive
source: Privileged runtime may still be active
zh_hans: 特权运行时可能仍处于活动状态

# diagnostics.cleanup.title
source: Cleanup
zh_hans: 清理

# diagnostics.component.configuration
source: Configuration
zh_hans: 配置

# diagnostics.component.internet
source: Internet
zh_hans: 互联网

# diagnostics.component.mihomoProcess
source: Mihomo Process
zh_hans: Mihomo 进程

# diagnostics.component.mixedPort
source: Mixed Port
zh_hans: 混合端口

# diagnostics.component.network
source: Network
zh_hans: 网络

# diagnostics.component.systemProxy
source: System Proxy
zh_hans: 系统代理

# diagnostics.controller.connectedVersionFormat
source: Connected · %@
zh_hans: 已连接 · %@

# diagnostics.core.architecture.thin
source: thin
zh_hans: 单一架构

# diagnostics.core.architecture.title
source: Architecture
zh_hans: 架构

# diagnostics.core.architecture.universal
source: universal
zh_hans: 通用二进制

# diagnostics.core.architecture.width32
source: 32-bit
zh_hans: 32 位

# diagnostics.core.architecture.width64
source: 64-bit
zh_hans: 64 位

# diagnostics.core.codeSignature.appAndComponentValid
source: App and privileged component valid
zh_hans: 应用与特权组件均有效

# diagnostics.core.codeSignature.title
source: Code Signature
zh_hans: 代码签名

# diagnostics.core.executable.modeFormat
source: Mode %@
zh_hans: 模式 %@

# diagnostics.core.executable.title
source: Executable
zh_hans: 可执行文件

# diagnostics.core.fileType.regular
source: Regular file
zh_hans: 普通文件

# diagnostics.core.fileType.title
source: File Type
zh_hans: 文件类型

# diagnostics.core.manifest.title
source: Manifest
zh_hans: 清单

# diagnostics.core.signedLifecycleVerified
source: Signed lifecycle verified
zh_hans: 已验证签名生命周期

# diagnostics.core.symbolicLink.title
source: Symbolic Link
zh_hans: 符号链接

# diagnostics.core.team.adHocDevelopment
source: Ad hoc development
zh_hans: 临时签名开发版本

# diagnostics.core.team.title
source: Team
zh_hans: 团队

# diagnostics.core.versionProbe.title
source: Version Probe
zh_hans: 版本探测

# diagnostics.coreLifecycle.activationTransaction.manualRepairFormat
source: Manual repair required · %@
zh_hans: 需要手动修复 · %@

# diagnostics.coreLifecycle.activationTransaction.retainedFormat
source: Retained · %@ · %@
zh_hans: 已保留 · %@ · %@

# diagnostics.coreLifecycle.activationTransaction.title
source: Activation Transaction
zh_hans: 激活事务

# diagnostics.coreLifecycle.activeCoreBlocked
source: Active Core is blocked
zh_hans: 当前 Core 已被阻止

# diagnostics.coreLifecycle.activeCoreVerification.title
source: Active Core Signature / Version
zh_hans: 当前 Core 签名 / 版本

# diagnostics.coreLifecycle.blockedStatus.title
source: Blocked Status
zh_hans: 阻止状态

# diagnostics.coreLifecycle.catalog.expiredDetailFormat
source: Keys: %@ · expired %@. Installed Cores remain usable, but new installs are blocked.
zh_hans: 密钥：%@ · 已于 %@ 过期。已安装的 Core 仍可使用，但新安装已被阻止。

# diagnostics.coreLifecycle.catalog.expiredResponseDetail
source: The signed response was expired. Installed Cores remain usable, but new installs are blocked until a fresh Catalog is available.
zh_hans: 签名响应已过期。已安装的 Core 仍可使用，但在获得最新 Catalog 前将阻止新安装。

# diagnostics.coreLifecycle.catalog.keysExpiryFormat
source: Keys: %@ · expires %@
zh_hans: 密钥：%@ · 到期时间 %@

# diagnostics.coreLifecycle.catalog.productionFeedGated
source: Production feed gated
zh_hans: 生产源尚未启用

# diagnostics.coreLifecycle.catalog.productionFeedGatedDetail
source: No external Core can be downloaded until an HTTPS feed and production trust roots ship in a signed app update.
zh_hans: 在已签名的应用更新提供 HTTPS 源与生产信任根之前，无法下载外部 Core。

# diagnostics.coreLifecycle.catalog.rejected
source: Rejected
zh_hans: 已拒绝

# diagnostics.coreLifecycle.catalog.title
source: Catalog Signature / Sequence / Expiry
zh_hans: Catalog 签名 / 序列 / 有效期

# diagnostics.coreLifecycle.catalogClock.title
source: System Clock / Catalog Freshness
zh_hans: 系统时钟 / Catalog 时效性

# diagnostics.coreLifecycle.componentCoreProtocol.title
source: Privileged Component Core Protocol
zh_hans: 特权组件 Core 协议

# diagnostics.coreLifecycle.factoryCore.title
source: Factory Core
zh_hans: 出厂 Core

# diagnostics.coreLifecycle.factoryFallback
source: Factory fallback
zh_hans: 出厂 Core 回退

# diagnostics.coreLifecycle.pendingRuntimePreflight
source: Pending runtime preflight
zh_hans: 等待运行时预检

# diagnostics.coreLifecycle.previousKnownGood.title
source: Previous Known Good
zh_hans: 上一个已知良好版本

# diagnostics.coreLifecycle.probation.title
source: Probation
zh_hans: 试运行

# diagnostics.coreLifecycle.protocolV2
source: Protocol v2
zh_hans: 协议 v2

# diagnostics.coreLifecycle.storeParity.title
source: User / Privileged Store Parity
zh_hans: 用户 / 特权存储一致性

# diagnostics.coreLifecycle.synchronizationRequired
source: Synchronization required
zh_hans: 需要同步

# diagnostics.corePreflight.failure.detailFormat
source: %@ Reinstall Vela from a trusted distribution; Vela will not replace the bundled Core at runtime.
zh_hans: %@ 请从可信分发渠道重新安装 Vela；Vela 不会在运行时替换应用内置 Core。

# diagnostics.corePreflight.failure.title
source: Core Integrity Check Failed
zh_hans: Core 完整性检查失败

# diagnostics.export.invalidUtf8
source: The redacted diagnostics preview is not valid UTF-8.
zh_hans: 脱敏诊断预览不是有效的 UTF-8 文本。

# diagnostics.export.privilegedLogsExcluded.countIntegerFormat
source: Raw privileged startup logs are excluded by default. %lld redacted entries are available.
zh_hans: 默认不包含原始特权启动日志。现有 %lld 条脱敏日志可供选择。

# diagnostics.export.privilegedLogsIncluded.detail
source: Startup logs can contain network or configuration details. They will be redacted again and shown in the exact export preview.
zh_hans: 启动日志可能包含网络或配置详情。日志会再次脱敏，并显示在最终导出预览中。

# diagnostics.export.privilegedLogsIncluded.title
source: Privileged Logs Included
zh_hans: 已包含特权日志

# diagnostics.export.writeFailed
source: The diagnostics file could not be written.
zh_hans: 无法写入诊断文件。

# diagnostics.health.critical
source: Critical issue
zh_hans: 严重问题

# diagnostics.health.healthy
source: Healthy
zh_hans: 健康

# diagnostics.health.needsAttention
source: Needs attention
zh_hans: 需要处理

# diagnostics.health.needsReview
source: Needs review
zh_hans: 需要检查

# diagnostics.process.stoppedValidating
source: Stopped · validating
zh_hans: 已停止 · 正在验证

# diagnostics.process.title
source: Process
zh_hans: 进程

# diagnostics.providers.catalog.title
source: Provider Catalog
zh_hans: 供应商目录

# diagnostics.providers.fetchErrors.countIntegerFormat
source: Fetch errors: %lld
zh_hans: 获取错误：%lld

# diagnostics.providers.loaded.countIntegerFormat
source: %lld providers loaded
zh_hans: 已加载 %lld 个供应商

# diagnostics.providers.noneReported
source: No providers reported
zh_hans: 未报告任何供应商

# diagnostics.registration.bundleLayoutVerified
source: Bundle layout verified
zh_hans: 已验证 Bundle 布局

# diagnostics.registration.component.title
source: Privileged Component
zh_hans: 特权组件

# diagnostics.registration.componentSignature.title
source: Privileged Component Signature
zh_hans: 特权组件签名

# diagnostics.registration.helperProtocol.title
source: Helper Protocol
zh_hans: Helper 协议

# diagnostics.registration.rootDirectory.title
source: Root Directory
zh_hans: Root 目录

# diagnostics.registration.rootDirectory.verified
source: Ownership, permissions, and no-symlink policy verified at Helper bootstrap
zh_hans: 已在 Helper 启动时验证所有权、权限及禁止符号链接策略

# diagnostics.registration.smAppService.title
source: SMAppService Registration
zh_hans: SMAppService 注册

# diagnostics.registration.startupJournalRecovery.completed
source: Completed before XPC was exposed
zh_hans: 已在 XPC 开放前完成

# diagnostics.registration.startupJournalRecovery.title
source: Startup Journal Recovery
zh_hans: 启动日志恢复

# diagnostics.registration.title
source: Registration
zh_hans: 注册

# diagnostics.registration.unavailableInLaunchMode
source: Unavailable in this launch mode
zh_hans: 当前启动模式不可用

# diagnostics.registration.xpcAuthentication.authenticated
source: Authenticated
zh_hans: 已认证

# diagnostics.registration.xpcAuthentication.notConnected
source: Not connected
zh_hans: 未连接

# diagnostics.registration.xpcAuthentication.title
source: XPC Authentication
zh_hans: XPC 认证

# diagnostics.runtime.configurationIntegrity.title
source: Configuration Integrity
zh_hans: 配置完整性

# diagnostics.runtime.controllerLoopback.notReachable
source: Not reachable
zh_hans: 无法访问

# diagnostics.runtime.controllerLoopback.reachable
source: 127.0.0.1 reachable with per-start secret
zh_hans: 127.0.0.1 可访问，并使用每次启动生成的密钥

# diagnostics.runtime.controllerLoopback.title
source: Controller Loopback
zh_hans: Controller 回环

# diagnostics.runtime.ownerLease.stableErrorFormat
source: Stable error: %@
zh_hans: 稳定错误码：%@

# diagnostics.runtime.ownerLease.title
source: Owner Lease
zh_hans: 所有者租约

# diagnostics.runtime.privilegedRuntime.title
source: Privileged Runtime
zh_hans: 特权运行时

# diagnostics.runtime.processIdentity.noOwnedProcess
source: No running owned process
zh_hans: 没有正在运行且归 Vela 所有的进程

# diagnostics.runtime.processIdentity.title
source: Process Identity
zh_hans: 进程身份

# diagnostics.runtime.processIdentity.verified
source: Verified at launch; revalidated before any signal
zh_hans: 已在启动时验证；发送任何信号前均会重新验证

# diagnostics.runtime.routes.title
source: Routes
zh_hans: 路由

# diagnostics.runtime.tunConfiguration.title
source: TUN Configuration
zh_hans: TUN 配置

# diagnostics.runtime.tunInterface.title
source: TUN Interface
zh_hans: TUN 接口

# diagnostics.signing.notarizationRequirement
source: An Accepted notarization result and successful staple validation are required before distribution can claim notarization.
zh_hans: 只有公证结果为 Accepted 且 staple 验证成功，分发版本才能声明已完成公证。

# diagnostics.signing.notVerified
source: Signing not verified · Notarization not checked
zh_hans: 签名未验证 · 公证未检查

# diagnostics.signing.title
source: Signing / Notarization
zh_hans: 签名 / 公证

# diagnostics.signing.verifiedTeamFormat
source: Signing verified (Team %@) · Notarization not checked
zh_hans: 签名已验证（Team %@）· 公证未检查

# diagnostics.summary.completion
source: Diagnostic completion
zh_hans: 诊断完成度

# diagnostics.summary.evaluatedIntegerFormat
source: %lld of %lld evaluated
zh_hans: 已评估 %lld / %lld

# diagnostics.summary.lastCheckedObjectFormat
source: Last checked %@ · errors are shown first
zh_hans: 上次检查 %@ · 错误优先显示

# diagnostics.summary.minimumEvidenceHint
source: Run diagnostics to collect the minimum evidence needed for a health score.
zh_hans: 运行诊断，以收集生成健康评分所需的最低证据。

# diagnostics.summary.notChecked
source: Not checked yet · Run diagnostics to refresh every check
zh_hans: 尚未检查 · 运行诊断以刷新所有检查

# diagnostics.summary.notEvaluated
source: Not evaluated
zh_hans: 未评估

# diagnostics.summary.systemHealth
source: System Health
zh_hans: 系统健康

# diagnostics.updatesCore.open
source: Updates & Core
zh_hans: 更新与内核

# diagnostics.updatesCore.open.help
source: Inspect application updates, Core trust, activation, and recovery readiness.
zh_hans: 检查应用更新、内核信任、激活与恢复就绪状态。

# diagnostics.value.active
source: Active
zh_hans: 活动

# diagnostics.value.applied
source: Applied
zh_hans: 已应用

# diagnostics.value.available
source: Available
zh_hans: 可用

# diagnostics.value.changed
source: Changed
zh_hans: 已更改

# diagnostics.value.checking
source: Checking…
zh_hans: 正在检查…

# diagnostics.value.clean
source: Clean
zh_hans: 正常

# diagnostics.value.connected
source: Connected
zh_hans: 已连接

# diagnostics.value.connecting
source: Connecting…
zh_hans: 正在连接…

# diagnostics.value.disconnected
source: Disconnected
zh_hans: 已断开连接

# diagnostics.value.enabled
source: Enabled
zh_hans: 已启用

# diagnostics.value.failed
source: Failed
zh_hans: 失败

# diagnostics.value.inactive
source: Inactive
zh_hans: 未活动

# diagnostics.value.incompatible
source: Incompatible
zh_hans: 不兼容

# diagnostics.value.invalid
source: Invalid
zh_hans: 无效

# diagnostics.value.matches
source: Matches
zh_hans: 匹配

# diagnostics.value.notActive
source: Not active
zh_hans: 未活动

# diagnostics.value.notApplied
source: Not applied
zh_hans: 未应用

# diagnostics.value.notBlocked
source: Not blocked
zh_hans: 未阻止

# diagnostics.value.notChecked
source: Not checked
zh_hans: 未检查

# diagnostics.value.notEnabled
source: Not enabled
zh_hans: 未启用

# diagnostics.value.notPresent
source: Not present
zh_hans: 不存在

# diagnostics.value.notReady
source: Not ready
zh_hans: 未就绪

# diagnostics.value.notRequested
source: Not requested
zh_hans: 未请求

# diagnostics.value.notValidated
source: Not validated
zh_hans: 未验证

# diagnostics.value.notVerified
source: Not verified
zh_hans: 未验证

# diagnostics.value.present
source: Present
zh_hans: 存在

# diagnostics.value.ready
source: Ready
zh_hans: 就绪

# diagnostics.value.refreshing
source: Refreshing…
zh_hans: 正在刷新…

# diagnostics.value.running
source: Running
zh_hans: 正在运行

# diagnostics.value.stopped
source: Stopped
zh_hans: 已停止

# diagnostics.value.transitioning
source: Transitioning…
zh_hans: 正在切换…

# diagnostics.value.unavailable
source: Unavailable
zh_hans: 不可用

# diagnostics.value.unknown
source: unknown
zh_hans: 未知

# diagnostics.value.valid
source: Valid
zh_hans: 有效

# diagnostics.value.validating
source: Validating…
zh_hans: 正在验证…

# diagnostics.workspace.applicability.always
source: Always applicable on macOS
zh_hans: 始终适用于 macOS

# diagnostics.workspace.applicability.currentMac
source: Applicable to this Mac when the related feature is available
zh_hans: 相关功能可用时适用于此 Mac

# diagnostics.workspace.applicability.running
source: Applicable while Mihomo is expected to be running
zh_hans: 预期 Mihomo 运行时适用

# diagnostics.workspace.blocked
source: Blocked
zh_hans: 受阻

# diagnostics.workspace.confidence.directObservation
source: Direct bounded runtime observation
zh_hans: 直接的有界运行时观测

# diagnostics.workspace.confidence.stateDerived
source: Derived from the current typed Vela state
zh_hans: 由当前 Vela 类型化状态推导

# diagnostics.workspace.confidence.unavailable
source: Unavailable until the check runs
zh_hans: 检查运行前不可用

# diagnostics.workspace.engine.requiresMihomo
source: Start Mihomo before collecting runtime health evidence.
zh_hans: 请先启动 Mihomo，再收集运行时健康证据。

# diagnostics.workspace.evidence.notCollected
source: No evidence has been collected.
zh_hans: 尚未收集证据。

# diagnostics.workspace.notApplicable
source: Not applicable
zh_hans: 不适用

# diagnostics.workspace.notRun
source: Not run
zh_hans: 未运行

# diagnostics.workspace.notRun.detail
source: Run all checks to collect this evidence.
zh_hans: 运行全部检查以收集此证据。

# diagnostics.workspace.openLogs.unavailable
source: This page does not own application navigation. Open Logs from the sidebar.
zh_hans: 此页面不负责应用导航。请从侧边栏打开日志。

# diagnostics.workspace.permission.privilegedComponent
source: Privileged component approval
zh_hans: 特权组件授权

# diagnostics.workspace.permission.privilegedComponent.purpose
source: macOS approval is required before Vela can authenticate and inspect the privileged TUN runtime.
zh_hans: Vela 验证并检查特权 TUN 运行时前需要 macOS 授权。

# diagnostics.workspace.permission.privilegedComponent.unavailable
source: The privileged component cannot be inspected until its registration is repaired.
zh_hans: 修复注册前无法检查特权组件。

# diagnostics.workspace.privileged.unavailable
source: Privileged component diagnostics are unavailable in this launch mode.
zh_hans: 当前启动模式下无法使用特权组件诊断。

# diagnostics.workspace.provider.requiresController
source: Start Mihomo and wait for the Controller to connect before refreshing provider diagnostics.
zh_hans: 请启动 Mihomo 并等待 Controller 连接后，再刷新 Provider 诊断。

# diagnostics.workspace.registry.duplicateIDs
source: The diagnostic registry contains duplicate check IDs: %@
zh_hans: 诊断注册表包含重复的检查 ID：%@

# diagnostics.workspace.rerunAtomicReason
source: The existing Engine Health registry exposes this check only through its atomic Run All operation.
zh_hans: 现有 Engine Health 注册表仅通过原子化的“运行全部”操作提供此检查。

# diagnostics.workspace.rerunUnavailable
source: This check cannot be refreshed in the current application state.
zh_hans: 当前应用状态下无法刷新此检查。

# diagnostics.workspace.run.progressFormat
source: Run %1$@ · %2$lld / %3$lld · %4$@ · %5$@
zh_hans: 运行 %1$@ · %2$lld / %3$lld · %4$@ · %5$@

# diagnostics.workspace.runStepTimedOut
source: Timed out after %@ seconds.
zh_hans: %@ 秒后超时。

# diagnostics.workspace.skipped
source: Skipped
zh_hans: 已跳过

# diagnostics.workspace.skipped.noRuntime
source: The runtime prerequisite was not available.
zh_hans: 运行时前置条件不可用。

# diagnostics.workspace.source.cleanup
source: Owned privileged-runtime cleanup state
zh_hans: 所拥有特权运行时的清理状态

# diagnostics.workspace.source.coreIntegrity
source: Bundled Core integrity preflight
zh_hans: 内置内核完整性预检

# diagnostics.workspace.source.coreLifecycle
source: Signed Core lifecycle snapshot
zh_hans: 已签名内核生命周期快照

# diagnostics.workspace.source.engineHealth
source: Engine health report
zh_hans: 引擎健康报告

# diagnostics.workspace.source.privilegedRegistration
source: Privileged component registration and authenticated handshake
zh_hans: 特权组件注册与已认证握手

# diagnostics.workspace.source.privilegedRuntime
source: Authenticated privileged runtime health snapshot
zh_hans: 已认证特权运行时健康快照

# diagnostics.workspace.source.providerCatalog
source: Mihomo Controller provider catalog
zh_hans: Mihomo Controller 供应商目录

# diagnostics.workspace.source.signing
source: Privileged component signing snapshot
zh_hans: 特权组件签名快照

# diagnostics.workspace.stale
source: Stale
zh_hans: 已过期

# error.configurationEditor.export
source: The runnable configuration could not be prepared for export.
zh_hans: 无法准备可供导出的可运行配置。

# error.configurationEditor.load
source: The configuration overrides could not be loaded.
zh_hans: 无法加载配置覆盖项。

# error.configurationEditor.preview
source: The configuration preview could not be generated.
zh_hans: 无法生成配置预览。

# error.configurationEditor.rawSave
source: The configuration file could not be saved.
zh_hans: 无法保存配置文件。

# error.configurationEditor.save
source: The configuration overrides could not be saved.
zh_hans: 无法保存配置覆盖项。

# error.configurationRecovery.action
source: Open Diagnostics and copy the redacted recovery code. Scheduled remote profile updates remain paused until recovery succeeds on a later launch.
zh_hans: 打开“诊断”并复制已脱敏的恢复代码。在之后某次启动恢复成功前，计划的远程配置更新将保持暂停。

# error.configurationRecovery.message
source: Vela could not safely finish recovering an interrupted configuration change.
zh_hans: Vela 无法安全完成中断配置更改的恢复。

# error.configurationRecovery.title
source: Configuration Recovery Needs Attention
zh_hans: 配置恢复需要处理

# error.subscription.addressInvalid
source: The subscription address or redirect policy is not valid.
zh_hans: 订阅地址或重定向策略无效。
